app/Controllers/AdminController.php

SELECT `consulta`.*, `usuario`.`nombre` as `usuario_nombre`
FROM `consulta`
LEFT JOIN `usuario` ON `usuario`.`id` = `consulta`.`usuario_id`
ORDER BY `fecha` DESC
---
    public function consultas()
    {
        $consultas = $this->consultaModel->select('consulta.*, usuario.nombre as usuario_nombre')
            ->join('usuario', 'usuario.id = consulta.usuario_id', 'left')
            ->orderBy('fecha', 'DESC')
            ->findAll();

SELECT *
FROM `consulta`
WHERE `consulta`.`id` = '8'
UPDATE `consulta` SET `estado` = 'pendiente'
WHERE `consulta`.`id` IN ('8')
---
    public function cambiarEstadoConsulta($id)
    {
        $consulta = $this->consultaModel->find($id);
        if (!$consulta) {
            return redirect()->to('/admin/consultas')->with('error', 'Consulta no encontrada.');
        }

        $nuevoEstado = $consulta['estado'] === 'pendiente' ? 'respondida' : 'pendiente';
        $this->consultaModel->update($id, ['estado' => $nuevoEstado]);