app/Controllers/ContactController.php

        'fecha' => date('Y-m-d H:i:s')
    ];

    $this->consultaModel->insert($data);
---
INSERT INTO `consulta` (`usuario_id`, `nombre`, `email`, `telephone`, `asunto`, `mensaje`, `contact_preference`, `estado`, `fecha`) VALUES (NULL, 'manchita', 'manchitamaumauscher@hotmail.com', 'miau', 'Consulta general', 'miau miau miau? miau miau...', 'WhatsApp', 'Pendiente', '2025-06-21 01:35:53')