app/Controllers/UserController.php

SELECT *
FROM `usuario`
WHERE `usuario`.`id` = '1'
SELECT `orden`.`id`, `orden`.`total`, `orden`.`estado`, `orden`.`fecha_creacion`
FROM `orden`
WHERE `orden`.`usuario_id` = '1'
SELECT *
FROM `factura`
WHERE `orden_id` = '4'
 LIMIT 1
---
    public function miCuenta()
    {
        // Verificar si el usuario está autenticado
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Debés iniciar sesión para ver esta sección.');
        }

        // Obtener el ID del usuario desde la sesión
        $userId = session()->get('id');
        $userModel = new UsuarioModel();
        $ordenModel = new OrdenModel();
        $detalleModel = new DetalleModel();
        $facturaModel = new FacturaModel();

        // Obtener datos del usuario
        $usuario = $userModel->find($userId);
        if (!$usuario) {
            return redirect()->to('/')->with('error', 'Usuario no encontrado.');
        }

        // Obtener órdenes del usuario con detalles
        $ordenes = $ordenModel->select('orden.id, orden.total, orden.estado, orden.fecha_creacion')
                              ->where('orden.usuario_id', $userId)
                              ->findAll();

        // Obtener facturas asociadas a las órdenes
        $facturas = [];
        foreach ($ordenes as $orden) {
            $facturas[$orden['id']] = $facturaModel->where('orden_id', $orden['id'])->first();

SELECT `orden_detalle`.`cantidad`, `orden_detalle`.`precio_unitario`, `orden_detalle`.`subtotal`, `producto`.`nombre`
FROM `orden_detalle`
JOIN `producto` ON `producto`.`id` = `orden_detalle`.`producto_id`
WHERE `orden_detalle`.`orden_id` = '4'
---

        // Opcional: Obtener detalles de cada orden
        foreach ($ordenes as &$orden) {
            $orden['detalles'] = $detalleModel->select('orden_detalle.cantidad, orden_detalle.precio_unitario, orden_detalle.subtotal, producto.nombre')
                                             ->join('producto', 'producto.id = orden_detalle.producto_id')
                                             ->where('orden_detalle.orden_id', $orden['id'])
                                             ->findAll();