app/Models/CarritoModel.php

SELECT `itemcarrito`.`id`, `itemcarrito`.`producto_id`, `itemcarrito`.`cantidad`, `producto`.`nombre`, `producto`.`precio`
FROM `itemcarrito`
JOIN `producto` ON `producto`.`id` = `itemcarrito`.`producto_id`
WHERE `itemcarrito`.`usuario_id` = '1'
---
    public function obtenerItemsPorUsuario($usuario_id)
    {
        return $this->select('itemcarrito.id, itemcarrito.producto_id, itemcarrito.cantidad, producto.nombre, producto.precio')
                    ->join('producto', 'producto.id = itemcarrito.producto_id')
                    ->where('itemcarrito.usuario_id', $usuario_id)
                    ->findAll();